import  'package:adv_basics/models/quiz_question.dart';

const questions = [
  QuizQuestion('Πότε γνωρίστηκαν ο Θέμης με την Στέλλα?', [
    '10/04/2021',
    '15/05/2021',
    '21/06/2021',
    '07/05/2021'
  ]),
  QuizQuestion('Πότε βγήκαν το πρώτο τους official ραντεβου?', [
    '14/05/2021',
    '15/05/2021',
    '16/04/2021',
    '06/06/2021'
  ]),
  QuizQuestion('Ποιά ατάκα χρησιμοποίησε ο Θέμης για να εκδηλώσει τα συναισθήματα του στην Στέλλα?', [
    'Μου αρέσεις',
    'Δε μπορώ τις αμήχανες στιγμές',
    'Έχεις κωλάρα',
    'Είμαι ερωτευμένος μαζί σου'
  ]),
  QuizQuestion('Τι φορούσε η Στέλλα στο πρώτο official ραντεβου?', [
    'Κολάν',
    'Παντελόνι',
    'Φούστα',
    'Φόρεμα'
  ]),
  QuizQuestion('Ποια ήταν η αφορμή του Θέμη για να στείλει το πρώτο μήνυμα στην Στέλλα?', [
    'Ζήτησε να τον εξυπηρετήσει για ενα ACS δέμα',
    'Ξέχασε τα κλειδιά του στο μαγαζί',
    'Έστειλε ένα "Γεια σου τι κάνεις"',
    'Η Στέλλα έστειλε πρώτη μήνυμα'
  ]),
  QuizQuestion('Πόσο αγαπάει ο Θέμης την Στέλλα?', [
    'Πιό πολύ απο χθες και λιγότερο απο αύριο',
    'Στο άπειρο και ακόμα παραπέρα',
    'Απο εκεί μέχρι εκεί και εκεί και εκεί',
    'Όσο ο Γουίνι το μέλι'
  ]),
  QuizQuestion('Ποιο ειναι το όνειρο τους σαν ζευγάρι?', [
    'Να μείνουν μαζί και να έχουν ένα σπίτι παιδότοπο',
    'Να μείνουν μαζί γενικά',
    'Να βγάλουν πολλά λεφτά και να ζουν πλουσιοπάροχα',
    'Να παίζουν όλη μέρα βιντεοπαιχνίδια μαζί'
  ]),
  QuizQuestion('Ποιο ειναι το πιο πρόσφατο παρατσουκλι του Θέμη?', [
    'Τσουτσουπρουκι',
    'Σκαντζοχοιράκι',
    'Μπισκοτάκι',
    'Σνακ!'
  ]),
  QuizQuestion('Ποιό ειναι το ποιο σύνηθες παρατσούκλι της Στέλλας?', [
    'Αλεπουδάκι',
    'Σκατό',
    'Ζουζουνάκι',
    'Ρακούν'
  ]),
  QuizQuestion('Ποιό ειναι το αγαπημένο φαγητό της Στέλλας?', [
    'Πατάτες τηγανιτές',
    'Μακρόνια',
    'Κεφτεδάκια με κόκκινη σάλτσα',
    'ο Θέμης'
  ])
];